{
  "format": "layers-model",
  "generatedBy": "keras v3.9.2",
  "convertedBy": "manual-export",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "trainable": true,
      "dtype": {
        "module": "keras",
        "class_name": "DTypePolicy",
        "config": {
          "name": "float32"
        },
        "registered_name": null
      },
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "input_layer",
            "batch_input_shape": [
              null,
              28,
              28,
              1
            ]
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_1",
            "trainable": true,
            "dtype": {
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              }
            },
            "filters": 8,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "build_config": {
            "input_shape": [
              null,
              28,
              28,
              1
            ]
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "maxpool_1",
            "trainable": true,
            "dtype": {
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              }
            },
            "pool_size": [
              2,
              2
            ],
            "padding": "valid",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_2",
            "trainable": true,
            "dtype": {
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              }
            },
            "filters": 8,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "build_config": {
            "input_shape": [
              null,
              13,
              13,
              8
            ]
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "maxpool_2",
            "trainable": true,
            "dtype": {
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              }
            },
            "pool_size": [
              2,
              2
            ],
            "padding": "valid",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten",
            "trainable": true,
            "dtype": {
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              }
            },
            "data_format": "channels_last"
          },
          "build_config": {
            "input_shape": [
              null,
              5,
              5,
              8
            ]
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": {
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              }
            },
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "build_config": {
            "input_shape": [
              null,
              200
            ]
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_1",
            "trainable": true,
            "dtype": {
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              }
            },
            "rate": 0.25,
            "seed": null,
            "noise_shape": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "dtype": {
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              }
            },
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "build_config": {
            "input_shape": [
              null,
              128
            ]
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": {
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              }
            },
            "rate": 0.25,
            "seed": null,
            "noise_shape": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "output",
            "trainable": true,
            "dtype": {
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              }
            },
            "units": 10,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "build_config": {
            "input_shape": [
              null,
              64
            ]
          }
        }
      ],
      "build_input_shape": [
        null,
        28,
        28,
        1
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "weights.bin"
      ],
      "weights": [
        {
          "name": "conv2d_1/kernel",
          "shape": [
            3,
            3,
            1,
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/bias",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_2/kernel",
          "shape": [
            3,
            3,
            8,
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_2/bias",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            200,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            128,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "output/kernel",
          "shape": [
            64,
            10
          ],
          "dtype": "float32"
        },
        {
          "name": "output/bias",
          "shape": [
            10
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}